<h1 align=center><font size = 5>Lab07</font></h1>
<h1 align=center><font size = 4>Pandas </font></h1>
<h1 align=center><font size = 4>October 10, 2020</font></h1>

In [2]:
import pandas as pd

In [3]:
my_dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }

**1- Create a DataFrame called `df` from the above dictionary**

Double-click __here__ for the solution.

<!-- Your answer is below:
# create a DataFrame called df
df = pd.DataFrame(dict)
df
-->

In [4]:
df = pd.DataFrame(my_dict)
df

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

**2- Set the index for `df` - ["BR", "RU", "IN", "CH", "SA"]**

In [5]:
df ['cap'] =  ["BR", "RU", "IN", "CH", "SA"]

In [6]:
df.set_index('cap')

          country    capital    area  population
cap
BR         Brazil   Brasilia   8.516      200.40
RU         Russia     Moscow  17.100      143.50
IN          India  New Dehli   3.286     1252.00
CH          China    Beijing   9.597     1357.00
SA   South Africa   Pretoria   1.221       52.98

Double-click __here__ for the solution.

<!-- Your answer is below:
# Set the index for df - ["BR", "RU", "IN", "CH", "SA"]
df.index = ["BR", "RU", "IN", "CH", "SA"]
-->

**3- Print out country column as Pandas Series**

In [7]:
df['country']

0          Brazil
1          Russia
2           India
3           China
4    South Africa
Name: country, dtype: object

Double-click __here__ for the solution.

<!-- Your answer is below:
df['country']
-->

**4- Print out country column as data frame**

In [8]:
df[['country']]

        country
0        Brazil
1        Russia
2         India
3         China
4  South Africa

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out country column as data frame 
df[['country']]
-->

**5- Print out a DataFrame with country and area columns**

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out country column as data frame 
df[['country', 'area]]
-->

**6- Print out the first 4 observations**

In [9]:
df.iloc[0:4]

  country    capital    area  population cap
0  Brazil   Brasilia   8.516       200.4  BR
1  Russia     Moscow  17.100       143.5  RU
2   India  New Dehli   3.286      1252.0  IN
3   China    Beijing   9.597      1357.0  CH

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out first 4 observations
df.iloc[0:4]
-->

**7- Print out fourth and fifth observations**

In [10]:
df.iloc[[3,4]]

        country   capital   area  population cap
3         China   Beijing  9.597     1357.00  CH
4  South Africa  Pretoria  1.221       52.98  SA

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out fourth and fifth observation
df[3:5]
-->

**8- Print out observation (row) for India**

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out observation (row) for India
df.iloc[2]
df.loc['IN']
-->

In [11]:
df.set_index('cap', inplace = True)

In [12]:
df

          country    capital    area  population
cap
BR         Brazil   Brasilia   8.516      200.40
RU         Russia     Moscow  17.100      143.50
IN          India  New Dehli   3.286     1252.00
CH          China    Beijing   9.597     1357.00
SA   South Africa   Pretoria   1.221       52.98

In [13]:
df.loc['IN']

country           India
capital       New Dehli
area              3.286
population         1252
Name: IN, dtype: object

**9- Get the area and population of china and India**

In [14]:
df.loc[['IN', 'CH'], ['area', 'population']]

      area  population
cap
IN   3.286      1252.0
CH   9.597      1357.0

Double-click __here__ for the solution.

<!-- Your answer is below:
# get the area and population of china and India
df.loc[['CH','IN'],['area','population']]
df.iloc[2:4,2:4]
-->

**10 - Read Grades.csv file into the pandas data frame and answer the following question:**
- Using the head method returns the first five rows
- Print out the column names
- Print out the row names as a list
- Get the dimensions of the data frame with shape
- Get the data type of each column
- Look at how many unique grades exist
- Get the mean, min, max of all the numric values
- Find the average of the final grade for each Grade category
- How many students got the Grade as "A"?
- Find the name of the student with the highest final grade

Double-click __here__ for the solution.

<!-- Your answer is below:
grades=pd.read_csv("Grades.csv")
grades.head()
list(grades.columns)
list(grades.index)
grades.shape
grades.dtypes
grades['Grade'].unique()
grades['Grade'].nunique()
grades_grouped = grades.groupby('Grade')
grades_grouped.mean()
grades_grouped.min()
grades_grouped.max()
grades_grouped.describe()
-->

In [4]:
import pandas as pd

In [15]:
df = pd.read_csv("Grades.csv")

In [16]:
df.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade
0,Jake,32,1,19.5,20,1,10.0,33.0,A
1,Joe,32,1,20.0,16,1,14.0,32.0,A
2,Susan,30,1,19.0,19,1,10.5,33.0,A-
3,Sol,31,1,22.0,13,1,13.0,34.0,A
4,Chris,30,1,19.0,17,1,12.5,33.5,A

In [17]:
df.columns

Index(['Name', 'Previous_Part', 'Participation1', 'Mini_Exam1', 'Mini_Exam2',
       'Participation2', 'Mini_Exam3', 'Final', 'Grade'],
      dtype='object')

In [18]:
list(df.index)

[0, 1, 2, 3, 4]

In [19]:
df.shape

(5, 9)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            5 non-null      object
 1   Previous_Part   5 non-null      int64
 2   Participation1  5 non-null      int64
 3   Mini_Exam1      5 non-null      float64
 4   Mini_Exam2      5 non-null      int64
 5   Participation2  5 non-null      int64
 6   Mini_Exam3      5 non-null      float64
 7   Final           5 non-null      float64
 8   Grade           5 non-null      object
dtypes: float64(3), int64(4), object(2)
memory usage: 488.0+ bytes

In [22]:
df['Grade'].nunique()

2

In [26]:
df.describe().loc[["count", "mean", "min"]]

,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final
count,5.0,5.0,5.0,5.0,5.0,5.0,5.0
mean,31.0,1.0,19.9,17.0,1.0,12.0,33.1
min,30.0,1.0,19.0,13.0,1.0,10.0,32.0

In [30]:
df.groupby("Grade").mean()["Final"]

Grade
A     33.125
A-    33.000
Name: Final, dtype: float64

In [32]:
df["Grade"].value_counts()["A"]

4

In [36]:
df[df["Final"] == df["Final"].max()]["Name"]

3    Sol
Name: Name, dtype: object

In [1]:
mylist = [0, 1, 2, 4]

In [2]:
4 % 2

0